app/views/ads/index.html.erb

SELECT `creatives`.* FROM `creatives` WHERE `creatives`.`ads_id` = 1
---
          <td style="text-align:right;">
            <% ad.creatives.each do |creative| %>

SELECT `targetings`.* FROM `targetings` WHERE `targetings`.`ads_id` = 1
SELECT `places`.* FROM `places` WHERE `places`.`targeting_id` = 1
---
          <td style="text-align:right;">
            <% ad.targetings.each do |targeting| %>
                gender: <%= targeting.gender %><br>
                <% targeting.places.each do |place| %>