app/views/ads/show.html.erb

    </p>
    <% if @ad.creatives.any? %>
---
SELECT  1 AS one FROM `creatives` WHERE `creatives`.`ad_id` = 1 LIMIT 1
SELECT `creatives`.* FROM `creatives` WHERE `creatives`.`ads_id` = 6

    <% end %>
    <% if @ad.targetings.any? %>
---
SELECT  1 AS one FROM `targetings` WHERE `targetings`.`ad_id` = 1 LIMIT 1
SELECT `targetings`.* FROM `targetings` WHERE `targetings`.`ad_id` = 7