app/controllers/ads_controller.rb

  def create
    @ad = Ad.new(ad_params)
    if validate
      if @ad.save
        redirect_to ads_path
      else
        render :new
      end
    else
      @ad.errors[:base] <<"Any creative has invalid Bid."
---
INSERT INTO `creatives` (`bid`, `adText`, `ad_id`, `created_at`, `updated_at`) VALUES ('pa', 'pei', 2, '2016-06-19 23:46:50', '2016-06-19 23:46:50')

  def update
    @ad = Ad.find params[:id]
    if validate
      if @ad.update_attributes(ad_params)
        redirect_to ad_url
      else
        render :edit
      end
    else
      @ad.errors[:base] <<"Any creative has invalid Bid."
---
INSERT INTO `creatives` (`bid`, `adText`, `ad_id`, `created_at`, `updated_at`) VALUES ('pa', 'pei', 1, '2016-06-19 23:46:34', '2016-06-19 23:46:34')