app/controllers/creatives_controller.rb

  def index
    @creatives = Creative.paginate(:page       => params[:page],
                       :per_page   => 10)
---
SELECT  `creatives`.* FROM `creatives` LIMIT 10 OFFSET 0

  def create
    @creative = Creative.new(creative_params)
    @creative.save
---
INSERT INTO `creatives` (`bid`, `adText`, `ads_id`, `created_at`, `updated_at`) VALUES ('teste', 'teste', 1, '2016-06-19 22:24:21', '2016-06-19 22:24:21')